Repository: FarisAlkr/ClientManagmentSystem
Catalog: lib/l10n/app_*.arb
Languages: he

# appTitle
source: Client Management
he: ניהול לקוחות

source: Client Management
he: ניהול לקוחות

source: Sign In
he: התחברות

source: Sign Up
he: הרשמה

source: Email
he: כתובת מייל

source: Password
he: סיסמה

source: Confirm Password
he: אימות סיסמה

# enterEmail
source: Please enter your email
he: נא להזין כתובת מייל

# enterValidEmail
source: Please enter a valid email
he: נא להזין כתובת מייל תקינה

# enterPassword
source: Please enter password
he: נא להזין סיסמה

# passwordMinLength
source: Password must be at least 6 characters
he: הסיסמה חייבת להיות לפחות 6 תווים

# confirmPasswordMessage
source: Please confirm your password
he: נא לאמת את הסיסמה

source: Passwords don't match
he: הסיסמאות אינן זהות

# haveAccount
source: Already have an account?
he: יש לך כבר חשבון?

# noAccount
source: Don't have an account?
he: אין לך חשבון?

source: Sign in to system
he: התחברות למערכת

# signUpToSystem
source: Register to system
he: הרשמה למערכת

# accountCreated
source: Account created successfully!
he: חשבון נוצר בהצלחה!

# errorOccurred
source: An error occurred
he: שגיאה התרחשה

source: User not found
he: לא נמצא משתמש עם כתובת מייל זו

source: Wrong password
he: סיסמה שגויה

# invalidEmail
source: Invalid email address
he: כתובת מייל לא תקינה

# userDisabled
source: User account is disabled
he: חשבון המשתמש הושבת

# tooManyRequests
source: Too many attempts. Try again later
he: יותר מדי ניסיונות. נסה שוב מאוחר יותר

# weakPassword
source: The password is too weak
he: הסיסמה חלשה מדי

# emailInUse
source: The email is already in use
he: כתובת המייל כבר בשימוש

# operationNotAllowed
source: Registration is not enabled
he: הרשמה אינה מופעלת

source: Southern Cities
he: ערים בדרום

source: Search cities...
he: חיפוש ערים...

# noCitiesFound
source: No cities found for
he: לא נמצאו ערים עבור

source: No cities in system
he: אין ערים במערכת

# addSouthernCities
source: Add southern Israeli cities
he: הוסף ערים בדרום ישראל

source: Add sample cities
he: הוסף ערים לדוגמא

source: Add New City
he: הוסף עיר חדשה

source: Clients
he: לקוחות

source: Client Details
he: פרטי לקוח

source: Search clients...
he: חיפוש לקוחות...

# noClientsFound
source: No clients found for
he: לא נמצאו לקוחות עבור

# noClientsInCity
source: No clients in
he: אין לקוחות ב

# addFirstClient
source: Add first client to get started
he: הוסף לקוח ראשון כדי להתחיל

source: Add Client
he: הוסף לקוח

source: Project Tasks
he: רשימת משימות פרויקט

source: Export PDF
he: יצוא PDF

source: Project Summary
he: סיכום פרויקט

source: Created
he: נוצר

source: Completed
he: הושלם

source: Overall Progress
he: התקדמות כללית

source: stages of
he: שלבים מתוך

source: Project Stages
he: שלבי הפרויקט

source: Add Task
he: הוסף משימה

source: Add Note
he: הוסף הערה

source: Add Custom Task
he: הוסף משימה

source: Add Custom Note
he: הוסף הערה

# writeTask
source: Write task name...
he: כתוב שם משימה...

source: Write note...
he: כתוב הערה...

source: Add
he: הוסף

source: Cancel
he: ביטול

source: Add notes...
he: הוסף הערות...

# idNumber
source: ID
he: ת.ז

source: Committee
he: ועדה

# errorLoadingClient
source: Error loading client details
he: שגיאה בטעינת פרטי ועדה

source: Error exporting PDF
he: שגיאה ביצוא PDF

# clientName
source: Name
he: שם

# clientId
source: ID
he: ת.ז

source: Property Address
he: כתובת הנכס

source: Handling Committee
he: ועדה מטפלת

source: Error loading project
he: שגיאה בטעינת פרויקט

source: Project not found
he: לא נמצא פרויקט

source: Error
he: שגיאה

source: Add New
he: הוסף חדש

source: Add New Client/Project
he: הוסף לקוח/פרויקט חדש

source: Manage Clients
he: ניהול לקוחות

source: Committees
he: ועדות

source: Search Clients by Committee
he: חיפוש לקוחות לפי ערים

# globalClientSearch
source: Search clients by committee
he: חיפוש לקוחות לפי ערים

# enterCommitteeOrCity
source: Enter committee or city name...
he: הכנס שם לקוח או עיר...

source: Search results for
he: תוצאות חיפוש עבור

# enterSearchTerm
source: Enter search term to find clients
he: הכנס מילת חיפוש כדי לחפש לקוחות

source: Pending Tasks
he: משימות ממתינות

# activeProjests
source: Active Projects
he: פרויקטים פעילים

source: Client Project Management System
he: מערכת ניהול פרויקטים ללקוחות

source: Add New Client
he: הוסף לקוח חדש

source: clients found
he: לקוחות נמצאו

source: Toggle Language
he: החלפת שפה

source: Sign Out
he: התנתקות

source: Try Again
he: נסה שוב

source: Adding cities...
he: מוסיף ערים...

# citiesAdded
source: cities added successfully
he: ערים נוספו בהצלחה

source: Error adding cities
he: שגיאה בהוספת ערים

source: Dark Mode
he: מצב לילה

source: Light Mode
he: מצב יום

source: System Mode
he: מצב מערכת

source: File Management
he: ניהול קבצים

source: Upload New Files
he: העלאת קבצים חדשים

# uploadOneOrMoreFiles
source: Upload one or more files to this task
he: העלה קובץ אחד או מספר קבצים למשימה זו

source: Choose Files to Upload
he: בחר קבצים להעלאה

source: Storage not available
he: Storage לא זמין

source: Existing Files
he: קבצים קיימים

source: Attached Files
he: קבצים מצורפים

source: Download All
he: הורד הכל

source: Loading files...
he: טוען קבצים...

source: Firebase Storage not configured
he: Firebase Storage לא מוגדר

# needToConfigureStorageRules
source: Need to configure Firebase Storage rules to use file management feature
he: יש צורך להגדיר Firebase Storage rules כדי להשתמש בתכונת ניהול הקבצים

source: No files attached
he: אין קבצים מצורפים

# uploadFilesUsingButtonAbove
source: Upload files using the upload button above
he: העלה קבצים באמצעות כפתור ההעלאה למעלה

source: File attached to task
he: קובץ מצורף למשימה

source: Download file
he: הורד קובץ

source: Delete file
he: מחק קובץ

source: User not logged in
he: משתמש לא מחובר

source: Error loading files
he: שגיאה בטעינת קבצים

source: Uploaded
he: הועלה

source: files of
he: מתוך

source: File uploaded successfully
he: הקובץ הועלה בהצלחה

source: files uploaded successfully
he: קבצים בהצלחה

source: Error uploading files
he: שגיאה בהעלאת קבצים

source: Downloading file
he: הורדת קובץ

source: File
he: קובץ

source: Copy link or click to download
he: העתק את הקישור או לחץ עליו להורדה

source: Close
he: סגור

source: Download
he: הורד

source: Error downloading file
he: שגיאה בהורדת קובץ

source: No files to download
he: אין קבצים להורדה

source: Preparing download
he: מכין הורדה

# filesReady
source: files ready to download
he: קבצים מוכנים להורדה

source: Cannot download files
he: לא ניתן להוריד קבצים

source: Download All Files
he: הורדת כל הקבצים

source: Downloading
he: מוריד

source: Deleting File
he: מחיקת קובץ

# confirmDeleteFile
source: Are you sure you want to delete the file
he: האם אתה בטוח שברצונך למחוק את הקובץ

source: Delete
he: מחק

source: File deleted successfully
he: הקובץ נמחק בהצלחה

source: Error deleting file
he: שגיאה במחיקת קובץ

source: Main Menu
he: תפריט ראשי

source: Statistics
he: סטטיסטיקה

source: Settings
he: הגדרות

source: User
he: משתמש

source: Unknown
he: לא ידוע

source: Verified
he: מאומת

source: Not Verified
he: לא מאומת

source: Registered
he: רשום

source: App Settings
he: הגדרות אפליקציה

# darkModeToggle
source: Dark Mode
he: מצב לילה

source: Enabled
he: מופעל

source: Disabled
he: מושבת

source: Language
he: שפה

source: Hebrew
he: עברית

source: English
he: אנגלית

source: Manage Committees
he: ניהול ועדות

# addEditDeleteCommittees
source: Add, edit and delete committees
he: הוסף, ערוך ומחק ועדות

source: Export Data
he: יצוא נתונים

source: Export all your data
he: יצא את כל הנתונים שלך

# aboutApp
source: About the App
he: אודות האפליקציה

source: Version
he: גרסה

source: Client Management System
he: מערכת ניהול לקוחות

source: Technical Support
he: תמיכה טכנית

source: Disconnect
he: התנתקות

# signOutTitle
source: Sign Out
he: התנתקות

# confirmSignOut
source: Are you sure you want to sign out?
he: האם אתה בטוח שברצונך להתנתק?

# exportDataTitle
source: Export Data
he: יצוא נתונים

# exportDataConfirm
source: Do you want to export all your data as a PDF file? The file will include: • All cities and committees • All clients • All projects • General statistics
he: האם ברצונך לייצא את כל הנתונים שלך כקובץ PDF? הקובץ יכלול: • את כל הערים והועדות • את כל הלקוחות • את כל הפרויקטים • סטטיסטיקה כללית

# exportDataButton
source: Export Data
he: יצא נתונים

source: Exporting data...
he: מייצא נתונים...

source: Data exported successfully
he: הנתונים יוצאו בהצלחה

source: Error exporting data
he: שגיאה ביצוא נתונים

# backupAndRestore
source: Backup & Restore Data
he: גיבוי ושחזור נתונים

# backupAllData
source: Backup all your data (cities, clients, projects) to a JSON file and restore when needed
he: גבה את כל הנתונים שלך (ערים, לקוחות, פרויקטים) לקובץ JSON ושחזר בעת הצורך

source: Export All Data (Backup)
he: יצא את כל הנתונים (גיבוי)

source: Restore Data from Backup
he: שחזר נתונים מגיבוי

source: City added successfully
he: העיר נוספה בהצלחה

source: Please select handling committee
he: נא לבחור ועדה מטפלת

source: Client details updated successfully
he: פרטי הלקוח עודכנו בהצלחה

source: Please enter ID number
he: נא להזין מספר תעודת זהות

source: ID must be 9 digits
he: תעודת זהות חייבת להיות בת 9 ספרות

source: ID must contain only digits
he: תעודת זהות חייבת להכיל ספרות בלבד

source: Edit Client Details -
he: עריכת פרטי לקוח -

# clientNameLabel
source: Client Name *
he: שם לקוח *

source: Full Name
he: שם מלא

source: Please enter client name
he: נא להזין שם לקוח

# clientNameMin2Chars
source: Client name must be at least 2 characters
he: שם לקוח חייב להיות לפחות 2 תווים

# propertyAddressLabel
source: Property Address *
he: כתובת הנכס *

source: Street, number, city
he: רחוב, מספר, עיר

source: Please enter property address
he: נא להזין כתובת נכס

# propertyAddressMin5Chars
source: Property address must be at least 5 characters
he: כתובת נכס חייבת להיות לפחות 5 תווים

# idNumberLabel
source: ID Number *
he: מספר תעודת זהות *

# handlingCommitteeLabel
source: Handling Committee *
he: ועדה מטפלת *

source: Search or select committee...
he: חפש או בחר ועדה...

# noCommitteesFound
source: No committees found - Add committee by clicking committees button
he: לא נמצאו ועדות - הוסף ועדה על ידי לחיצה על כפתור ועדות

source: Error loading committees
he: שגיאה בטעינת ועדות

source: * Required fields
he: * שדות חובה

source: Update Details
he: עדכן פרטים

source: Client added successfully
he: הלקוח נוסף בהצלחה

# addClientButton
source: Add Client
he: הוסף לקוח

source: Committee added successfully
he: הועדה נוספה בהצלחה

source: Add Committee
he: הוסף ועדה

source: Committee Name
he: שם ועדה

source: Please enter committee name
he: נא להזין שם ועדה

source: Save
he: שמור

source: Committee updated successfully
he: הועדה עודכנה בהצלחה

source: Edit Committee
he: ערוך ועדה

source: Search committees...
he: חיפוש ועדות...

source: No committees in system
he: אין ועדות במערכת

# noCommitteesFoundSearch
source: No committees found
he: לא נמצאו ועדות

# addFirstCommittee
source: Add first committee to get started
he: הוסף ועדה ראשונה כדי להתחיל

# errorLoadingCommitteesList
source: Error loading committees
he: שגיאה בטעינת הועדות

# deleteCommitteeTitle
source: Delete Committee
he: מחק ועדה

# confirmDeleteCommittee
source: Are you sure you want to delete "{name}"?
he: האם אתה בטוח שברצונך למחוק את "{name}"?

source: Committee deleted successfully
he: הוועדה נמחקה בהצלחה

# clientsIn
source: Clients -
he: לקוחות -

# searchClientsPlaceholder
source: Search clients...
he: חיפוש לקוחות...

source: No clients found for
he: לא נמצאו לקוחות עבור

source: Loading clients...
he: טוען לקוחות...

# noPermissionToAccessData
source: No permission to access data Please sign in again
he: אין הרשאה לגשת לנתונים אנא התחבר מחדש

# dataServiceUnavailable
source: Data service unavailable Check internet connection
he: שירות הנתונים אינו זמין בדוק את החיבור לאינטרנט

# dataNotFound
source: Data not found City may not exist
he: הנתונים לא נמצאו ייתכן שהעיר לא קיימת

source: Error loading data
he: שגיאה בטעינת הנתונים נסה שוב או פנה לתמיכה

# addFirstClientToStart
source: Add first client to get started
he: הוסף לקוח ראשון כדי להתחיל

source: Error loading client details
he: שגיאה בטעינת פרטי לקוח

source: Back
he: חזור

source: Client not found
he: לקוח לא נמצא

# clientDetailsTitle
source: Client Details
he: פרטי לקוח

# idNumberInfo
source: ID Number
he: מספר ת.ז

# propertyAddressInfo
source: Property Address
he: כתובת הנכס

# handlingCommitteeInfo
source: Handling Committee
he: ועדה מטפלת

source: View Project
he: צפה בפרויקט

source: Edit
he: ערוך

source: Export Details
he: יצא פרטים

source: Delete Client
he: מחק לקוח

# deleteClientTitle
source: Delete Client
he: מחק לקוח

# confirmDeleteClient
source: Are you sure you want to delete {name}? This action cannot be undone.
he: האם אתה בטוח שברצונך למחוק את {name}? פעולה זו אינה הפיכה.

source: Client deleted successfully
he: הלקוח נמחק בהצלחה

source: Error deleting client
he: שגיאה במחיקת לקוח

source: Committee already exists
he: הועדה כבר קיימת

source: Error adding committee
he: שגיאה בהוספת ועדה

# clientWithIdAlreadyExists
source: Client with this ID already exists in system
he: לקוח עם תעודת זהות זו כבר קיים במערכת

# noPermissionForAction
source: No permission to perform this action - Please sign in again
he: אין הרשאה לבצע פעולה זו - אנא התחבר מחדש

# firebaseServiceUnavailable
source: Firebase service unavailable - Check internet connection
he: שירות Firebase אינו זמין - בדוק את החיבור לאינטרנט

source: Firebase error
he: שגיאת Firebase

source: Error adding client
he: שגיאה בהוספת לקוח

# errorGeneral
source: Error
he: שגיאה

# accountPendingApproval
source: Your account is pending approval. Please wait for the administrator to approve your account.
he: חשבונך ממתין לאישור. אנא המתן עד שמנהל המערכת יאשר את החשבון שלך.

source: Pending Users
he: משתמשים ממתינים

source: User Management
he: ניהול משתמשים

source: Refresh Data...
he: רענן נתונים...

source: Approve
he: אשר

source: Reject
he: דחה

# userApprovedSuccessfully
source: User {email} approved successfully
he: משתמש {email} אושר בהצלחה

source: Error approving user
he: שגיאה באישור משתמש

# userRejected
source: User {email} rejected
he: משתמש {email} נדחה

source: Error rejecting user
he: שגיאה בדחיית משתמש

# noAdminPermissions
source: You don't have admin permissions
he: אין לך הרשאות מנהל

source: No pending users
he: אין משתמשים ממתינים לאישור

source: No users in system
he: אין משתמשים במערכת

source: Error signing out
he: שגיאה בהתנתקות

source: City Name
he: שם העיר

# enterCityName
source: Please enter city name
he: נא להזין שם עיר

# cityNameMin2Chars
source: City name must be at least 2 characters
he: שם העיר חייב להיות לפחות 2 תווים

source: Description
he: תיאור

source: Description (optional)
he: תיאור (אופציונלי)

source: Error adding city
he: שגיאה בהוספת עיר

# lightModeTooltip
source: Light Mode
he: מצב יום

# darkModeTooltip
source: Dark Mode
he: מצב לילה

# pendingApprovalTitle
source: Pending Approval
he: ממתין לאישור

# accountCreatedAwaitingApproval
source: Your account was created successfully and is awaiting admin approval.
he: חשבונך נוצר בהצלחה וממתין לאישור מנהל המערכת.

# pleaseWaitForApproval
source: Please wait for admin approval. Click 'Check Status Again' to try logging in again.
he: אנא המתן לאישור המנהל. לחץ על 'בדוק סטטוס שוב' כדי לנסות להתחבר מחדש.

source: Check Status Again
he: בדוק סטטוס שוב

source: Admin Panel
he: פאנל ניהול

# systemAdminLogin
source: System Administrator Login
he: כניסה למנהלי מערכת

source: Email Address
he: כתובת מייל

# enterEmailAddress
source: Please enter email address
he: נא להזין כתובת מייל

source: Login to Panel
he: כניסה לפאנל

source: Back to Main App
he: חזרה לאפליקציה הראשית

source: Refreshing data...
he: רענון נתונים...

source: Pending Approval
he: ממתינים לאישור

source: All Users
he: כל המשתמשים

source: Registration Date
he: תאריך הרשמה

source: Approval Date
he: תאריך אישור

source: Approved by
he: אושר על ידי

source: Rejection Date
he: תאריך דחייה

source: Rejected by
he: נדחה על ידי

source: Error logging out
he: שגיאה בהתנתקות

source: Not logged in
he: לא מחובר למערכת

# invalidCredentials
source: Invalid credentials - Email or password is incorrect
he: פרטי התחברות שגויים - אימייל או סיסמה לא נכונים

source: General error
he: שגיאה כללית

# accountPendingApprovalMessage
source: Your account is pending approval. Please wait for approval.
he: חשבונך ממתין לאישור מנהל. נא להמתין לאישור.

# accountRejectedMessage
source: Your account was rejected. Please contact the system administrator.
he: חשבונך נדחה. נא לפנות למנהל המערכת.

# accountNotApprovedMessage
source: Your account is not yet approved. Please contact the system administrator.
he: חשבונך טרם אושר. נא לפנות למנהל המערכת.

source: Unknown error
he: שגיאה לא ידועה

source: Login error
he: שגיאה בהתחברות

source: Account created successfully!
he: חשבון נוצר בהצלחה!

# accountAwaitingApproval
source: Your account is awaiting admin approval. Please wait until the admin approves your account.
he: החשבון שלך ממתין לאישור מנהל. אנא המתן עד שהמנהל יאשר את החשבון.

# approvalTime
source: Approval time: Usually 24-48 hours.
he: זמן אישור: 24-48 שעות בדרך כלל.

source: Add Stage
he: הוסף שלב

source: Delete Stage
he: מחק שלב

source: Stage Title
he: שם השלב

source: Enter stage name...
he: הזן שם שלב...

source: Edit Stage Title
he: ערוך שם שלב

# confirmDeleteStage
source: Are you sure you want to delete the stage "{name}"? This will delete all tasks in this stage.
he: האם אתה בטוח שברצונך למחוק את השלב "{name}"? פעולה זו תמחק את כל המשימות בשלב זה.
